In [1]:
print("hello")
%pip install pandas

hello
Requirement already satisfied: pandas in /Users/kannans100/MyPython/.venv/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in /Users/kannans100/MyPython/.venv/lib/python3.13/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/kannans100/MyPython/.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/kannans100/MyPython/.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/kannans100/MyPython/.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/kannans100/MyPython/.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

# Left DataFrame
df1 = pd.DataFrame({
    'id': [100, 200, 300,400],
    'name': ['Alice', 'Bob', 'Charlie','']
})

# Right DataFrame
df2 = pd.DataFrame({
    'id': [200, 300, 400],
    'score': [85, 90, 95]
})

In [3]:
pd.merge(df1, df2, on='id', how='inner')

    id     name  score
0  200      Bob     85
1  300  Charlie     90
2  400              95

In [4]:
pd.merge(df1, df2, on='id', how='left')

    id     name  score
0  100    Alice    NaN
1  200      Bob   85.0
2  300  Charlie   90.0
3  400            95.0

In [5]:
pd.merge(df1, df2, on='id', how='right')

    id     name  score
0  200      Bob     85
1  300  Charlie     90
2  400              95

In [6]:
pd.merge(df1, df2, on='id', how='outer')

    id     name  score
0  100    Alice    NaN
1  200      Bob   85.0
2  300  Charlie   90.0
3  400            95.0